Autodesk.Revit.DB.Visual.AdvancedWood.WoodCurlyDistortionMap
The property labeled "The 2D fiber distortion map (NO degamma op)" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodCurlyDistortionScale
The property labeled "The scale of distortion for secondary curly highlight" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodCurlyDistortionEnable
The property labeled "Enable distortion for wood secondary curly highlight" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLatecolorPerlinProf
The property labeled "Profile for latewood color perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLatecolorPerlinEnable
The property labeled "Use perlin noise for latewood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinProf
The property labeled "Profile for earlywood color perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinEnable
The property labeled "Use perlin noise for earlywood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinScaleZ
The property labeled "Anisotropic pos-z scale for secondary highlight perlin" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinProf
The property labeled "Profile for secondary highlight perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinEnable
The property labeled "Use perlin noise for secondary highlight" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinScaleZ
The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinProf
The property labeled "Profile for diffuse albedo perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinEnable
The property labeled "Use perlin function for diffuse albedo" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinProf
The property labeled "Profile for growth perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinEnable
The property labeled "Use perlin noise for ring growth" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineProf
The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineEnable
The property labeled "Use cosine function for wood fiber" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinScaleZ
The property labeled "Anisotropic pos-z scale for fiber perlin" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinProf
The property labeled "Profile for fiber perlin noise" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinEnable
The property labeled "Use perlin noise for wood fiber" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrooveRoughness
The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseGrooveRoughness
The property labeled "Use additional groove roughness" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLatewoodBumpDepth
The property labeled "Depth (cm) of the latewood bump" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseLatewoodBump
The property labeled "Use latewood bump" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffuseLobeWeight
The property labeled "Weight of diffuse lobe" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberRoughness
The property labeled "Roughness for secondary highlight" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseZ2x
The property labeled "Ratio between two radii of ray ellipse" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseRadiusX
The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayNumSlices
The property labeled "Number of slices in xy plane" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyInteger".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRaySegLengthZ
The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayColorPower
The property labeled "Power to compute ray color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseRays
The property labeled "Use rays feature" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreDepth
The property labeled "Bump depth variation (cm) for pores" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreColorPower
The property labeled "Power to compute pore color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreRadius
The property labeled "Radius (cm) of the impact circle of each pore" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreCellDim
The property labeled "Dim (cm) of cell containing one pore" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreType
The property labeled "Pore type" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WoodPoreType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodUsePores
The property labeled "Use pores feature" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodManualLateColor
The property labeled "Manual latewood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseManualLateColor
The property labeled "Use manual latewood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryColorPower
The property labeled "Power to compute secondary highlight color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLateColorPower
The property labeled "Power to compute latewood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlyColor
The property labeled "Earlywood color" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLatewoodSharpness
The property labeled "Percentage of pure latewood" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlywoodSharpness
The property labeled "Percentage of pure earlywood" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodLatewoodRatio
The property labeled "Percentage of latewood in each ring" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood.WoodRingThickness
The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedWood
A static class that provides access to the property names that appear in the AdvancedWood visual asset schema.
Since:
2018.1